snlkuharlocal/src/Documents/УстановкаСтатусаКМ/УстановкаСтатусаКМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаСтатусаКМ</name>
  <basedOn>Document.РасхожденияКодовМаркировкиМП</basedOn>
  <registerRecords>InformationRegister.СтатусыКМ_Факт</registerRecords>
  <registerRecords>InformationRegister.СтатусыКМ_Факт_А</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодУзлаСоздания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Комплектация</types>
      <types>DocumentRef.ОтчетКассовойСмены</types>
      <types>DocumentRef.ЗаказНаЭмиссиюКодовМаркировкиСУЗ</types>
      <types>DocumentRef.КонтрактСПроизводителем</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.ЗаданиеНаСборкуКомплектовЧЗ</types>
      <types>DocumentRef.Инвентаризация</types>
      <types>DocumentRef.РекламационнаяНакладная</types>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.ЛистНабора</types>
      <types>DocumentRef.РасхожденияКодовМаркировкиМП</types>
      <types>DocumentRef.СписаниеТМЦ</types>
      <types>DocumentRef.ЗаданиеНаМаркировку</types>
      <types>DocumentRef.МаркировкаТоваровИСМП</types>
      <types>DocumentRef.Машина</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <attributes>
    <name>Местонахождение</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВПути</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусФакт</name>
      <type>
        <types>EnumRef.СтатусыКодовМаркировкиФакт</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусЧЗ</name>
      <type>
        <types>EnumRef.СтатусыКодовМаркировкиИСМП</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/InformationRegisters/СтатусыКМ_Факт/СтатусыКМ_Факт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыКМ_Факт</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыКодовМаркировкиФакт</types>
    </type>
  </resources>
  <resources>
    <name>Местонахождение</name>
    <type>
      <types>CatalogRef.Склады</types>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>ВПути</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипШК</name>
    <type>
      <types>EnumRef.ТипыШтрихКодов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ШтрихКодУпаковки</name>
    <type>
      <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Documents/УстановкаСтатусаКМ/ObjectModule.bsl
#Область СобытияОбъекта

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ЗаполнитьШапкуДокумента(ЭтотОбъект, ПараметрыСеанса.Пользователь, ОбщегоНазначения_ПИ.ВалютаНац());	
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ДокументОснование	= МаркировкаКС.ПолучитьЗначениеПараметра(ДанныеЗаполнения, "ДокументОснование");
		ДопПараметры		= ДанныеЗаполнения;
	Иначе		
		ДокументОснование	= ДанныеЗаполнения;
		ДопПараметры		= Неопределено;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	НЗ_Факт = Движения.СтатусыКМ_Факт;
	
	НЗ_Факт.Очистить();
	
	Для каждого СтрокаШК Из ПолучитьТаблицуШК(Ссылка) Цикл
		Движение = НЗ_Факт.Добавить();
					
		Движение.Период 				= Дата;
		
		Движение.ШтрихКодУпаковки		= СтрокаШК.ШтрихкодУпаковки;				
		Движение.ТипШК					= СтрокаШК.ТипШК;
		Движение.Номенклатура			= СтрокаШК.Номенклатура;
		
		Движение.Статус					= СтрокаШК.СтатусФакт;
		Движение.Местонахождение		= Местонахождение;	
		Движение.ВПути					= ВПути;
	КонецЦикла;
	
	МаркировкаКС.СохранитьОтложенныеДвижения(ЭтотОбъект, Отказ);
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда Возврат КонецЕсли;
	
	Если ЭтоНовый() ИЛИ НЕ ЗначениеЗаполнено(КодУзлаСоздания) Тогда
		КодУзлаСоздания = Маркировка_ПИ.ЭтотУзел_Код();		
	КонецЕсли;
	
	рПроверки = лМожноЗаписатьДокумент();
	Если Не рПроверки.Успешно Тогда
		ТекстОшибки = СтрСоединить(рПроверки.Ошибки, Символы.ПС);
		ЗаписатьВЛог("ОбменДанными", ТекстОшибки, "Ошибка");
		Отказ = Истина;                         
		ВызватьИсключение ТекстОшибки;
		Возврат;
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

Функция лМожноЗаписатьДокумент()
	Результат = Новый Структура("Успешно,Ошибки", Истина, Новый Массив);
	
	Если ЭтоНовый() Тогда
		мКодУзлаСоздания = КодУзлаСоздания;
	Иначе 
		мКодУзлаСоздания = ПолучитьРеквизитШапки(Ссылка, "КодУзлаСоздания");
	КонецЕсли;		
		
	Если ОбменДанными.Загрузка Тогда
		УзелОтправитель = ОбменДанными.Отправитель;
		Если ЗначениеЗаполнено(УзелОтправитель) Тогда
			Если УзелОтправитель.Код <> мКодУзлаСоздания Тогда				
				Результат.Успешно = Ложь;							
				Результат.Ошибки.Добавить("Нельзя перезаписывать СКМ созданную в другом узле ! " + Ссылка + " создан: " + мКодУзлаСоздания);				
			ИначеЕсли мКодУзлаСоздания = Маркировка_ПИ.ЭтотУзел_Код() Тогда
				Результат.Успешно = Ложь;							
				Результат.Ошибки.Добавить("Можно загружать только СКМ созданные в других узлах ! "+ЭтотОбъект+" узел отправитель: "+УзелОтправитель.Код+", код узла создания: "+мКодУзлаСоздания);
			КонецЕсли; 			 
		КонецЕсли;
	Иначе
		Если НЕ ЭтоНовый() Тогда
			Если мКодУзлаСоздания <> Маркировка_ПИ.ЭтотУзел_Код() И Модифицированность() Тогда
				Результат.Успешно = Ложь;
				Результат.Ошибки.Добавить("Нельзя изменять СКМ созданную в другом узле ! "+Ссылка+" создан: "+мКодУзлаСоздания);
			КонецЕсли;
		КонецЕсли;
		
		Если Дата <= КонецДня(ОбщегоНазначения_ПИ.Константа_ДатаЗапретаРедактирования()) Тогда
			Результат.Успешно = Ложь;
			Результат.Ошибки.Добавить("Нарушение ДЗР !");
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции //лМожноЗаписатьДокумент()

Функция МожноПроводитьДокументВЭтомУзле()
	Результат = МаркировкаКС.СтруктураРезультата();
	
	КодТекУзла = ВРег(СокрЛП(Маркировка_ПИ.ЭтотУзел_Код("Основной")));	
	Если КодТекУзла <> СокрЛП(СокрЛП(КодУзлаСоздания)) Тогда 
		ТекстСообщения = СтрШаблон("Документ создан в узле: %1, текущий узел: %2.
		|Нельзя изменять проводить (распроводить) установки статусов полученные из других узлов !", КодУзлаСоздания, КодТекУзла);
		
		Результат.Успешно = Ложь;
		Результат.Ошибки.Добавить(ТекстСообщения);
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции // ()

Функция ПолучитьТаблицуШК(ДокСсылка)
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ШтрихкодУпаковки			КАК ШтрихкодУпаковки,
	|	ШтрихкодУпаковки.ТипШК		КАК ТипШК,
	|	ШтрихкодУпаковки.Владелец 	КАК Номенклатура,
	|	СтатусФакт					КАК СтатусФакт,
	|	СтатусЧЗ					КАК СтатусЧЗ
	|ИЗ
	|	" +  ДокСсылка.Метаданные().ПолноеИмя() + ".ШтрихкодыУпаковок
	|ГДЕ
	|	Ссылка = &ДокСсылка
	|";                             
	
	Запрос.УстановитьПараметр("ДокСсылка", ДокСсылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции //ПолучитьТаблицуШК(ДокСсылка)

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	Если ЗначениеЗаполнено(Организация) Тогда
		Префикс = СокрЛП(Организация.Префикс);	
	КонецЕсли; 
	Префикс = Префикс + Маркировка_ПИ.ЭтотУзел_Код("Основной") + "-";
КонецПроцедуры
